In [2]:
# Python Capstone Project

In [2]:
# Task 1: Create the three DataFrames and save them as CSVs
import pandas as pd
import numpy as np
# Project DataFrame
project_data = [
    ["A001","Project 1",1002000,"Finished"],
    ["A002","Project 2",2000000,"Ongoing"],
    ["A003","Project 3",4500000,"Finished"],
    ["A004","Project 4",5500000,"Ongoing"],
    ["A005","Project 5",np.nan,"Finished"],
    ["A002","Project 6",680000,"Failed"],
    ["A005","Project 7",400000,"Finished"],
    ["A003","Project 8",350000,"Failed"],
    ["A001","Project 9",np.nan,"Ongoing"],
    ["A003","Project 10",300000,"Finished"],
    ["A001","Project 11",2000000,"Failed"],
    ["A004","Project 12",1000000,"Ongoing"],
    ["A004","Project 13",3000000,"Finished"],
    ["A005","Project 14",200000,"Finished"],
]
df_project = pd.DataFrame(project_data, columns=["ID","Project","Cost","Status"])

# Employee DataFrame
employee_data = [
    ["A001","John Alter","M","Paris",25],
    ["A002","Alice Luxumberg","F","London",27],
    ["A003","Tom Sabestine","M","Berlin",29],
    ["A004","Nina Adgra","F","Newyork",31],
    ["A005","Amy Johny","F","Madrid",30],
]
df_employee = pd.DataFrame(employee_data, columns=["ID","Name","Gender","City","Age"])

# Seniority DataFrame
seniority_data = [
    ["A001",2],
    ["A002",2],
    ["A003",3],
    ["A004",2],
    ["A005",3],
]
df_seniority = pd.DataFrame(seniority_data, columns=["ID","Designation Level"])

# Save CSVs
df_project.to_csv("Project.csv", index=False)
df_employee.to_csv("Employee.csv", index=False)
df_seniority.to_csv("Seniority.csv", index=False)

df_project.head(), df_employee.head(), df_seniority.head()

(     ID    Project       Cost    Status
 0  A001  Project 1  1002000.0  Finished
 1  A002  Project 2  2000000.0   Ongoing
 2  A003  Project 3  4500000.0  Finished
 3  A004  Project 4  5500000.0   Ongoing
 4  A005  Project 5        NaN  Finished,
      ID             Name Gender     City  Age
 0  A001       John Alter      M    Paris   25
 1  A002  Alice Luxumberg      F   London   27
 2  A003    Tom Sabestine      M   Berlin   29
 3  A004       Nina Adgra      F  Newyork   31
 4  A005        Amy Johny      F   Madrid   30,
      ID  Designation Level
 0  A001                  2
 1  A002                  2
 2  A003                  3
 3  A004                  2
 4  A005                  3)

In [3]:
# Task 2: Replace missing costs with running average using for loop

project = pd.read_csv("Project.csv")
project["Cost"] = pd.to_numeric(project["Cost"], errors="coerce")

running_sum, count_seen = 0.0, 0
for i in range(len(project)):
    if pd.isna(project.loc[i,"Cost"]):
        project.loc[i,"Cost"] = running_sum/count_seen if count_seen>0 else 0
    else:
        running_sum += project.loc[i,"Cost"]
        count_seen += 1

project

      ID     Project          Cost    Status
0   A001   Project 1  1.002000e+06  Finished
1   A002   Project 2  2.000000e+06   Ongoing
2   A003   Project 3  4.500000e+06  Finished
3   A004   Project 4  5.500000e+06   Ongoing
4   A005   Project 5  3.250500e+06  Finished
5   A002   Project 6  6.800000e+05    Failed
6   A005   Project 7  4.000000e+05  Finished
7   A003   Project 8  3.500000e+05    Failed
8   A001   Project 9  2.061714e+06   Ongoing
9   A003  Project 10  3.000000e+05  Finished
10  A001  Project 11  2.000000e+06    Failed
11  A004  Project 12  1.000000e+06   Ongoing
12  A004  Project 13  3.000000e+06  Finished
13  A005  Project 14  2.000000e+05  Finished

In [15]:
# Task 3: Split Name into First Name and LastName
employee = pd.read_csv("Employee.csv")

# Use keyword arguments for n and expand
employee[["First Name","LastName"]] = employee["Name"].str.split(" ", n=1, expand=True)

# Drop the original Name column
employee.drop(columns=["Name"], inplace=True)

employee

     ID Gender     City  Age First Name   LastName
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

In [16]:
# Task 4: Join all three into Final

seniority = pd.read_csv("Seniority.csv")
final = project.merge(employee,on="ID").merge(seniority,on="ID")
final.head()

,ID,Project,Cost,Status,Gender,City,Age,First Name,LastName,Designation Level
0,A001,Project 1,1002000.0,Finished,M,Paris,25,John,Alter,2
1,A002,Project 2,2000000.0,Ongoing,F,London,27,Alice,Luxumberg,2
2,A003,Project 3,4500000.0,Finished,M,Berlin,29,Tom,Sabestine,3
3,A004,Project 4,5500000.0,Ongoing,F,Newyork,31,Nina,Adgra,2
4,A005,Project 5,NaN,Finished,F,Madrid,30,Amy,Johny,3

In [18]:
# Task 5: Add Bonus (5% of Cost for Finished)

final["Bonus"] = np.where(final["Status"].str.lower()=="finished", final["Cost"]*0.05, 0)
final[["Project","Status","Cost","Bonus"]]

       Project    Status       Cost     Bonus
0    Project 1  Finished  1002000.0   50100.0
1    Project 2   Ongoing  2000000.0       0.0
2    Project 3  Finished  4500000.0  225000.0
3    Project 4   Ongoing  5500000.0       0.0
4    Project 5  Finished        NaN       NaN
5    Project 6    Failed   680000.0       0.0
6    Project 7  Finished   400000.0   20000.0
7    Project 8    Failed   350000.0       0.0
8    Project 9   Ongoing        NaN       0.0
9   Project 10  Finished   300000.0   15000.0
10  Project 11    Failed  2000000.0       0.0
11  Project 12   Ongoing  1000000.0       0.0
12  Project 13  Finished  3000000.0  150000.0
13  Project 14  Finished   200000.0   10000.0

In [7]:
# Task 6: Demote designation for Failed projects, drop >4

import pandas as pd
final = pd.DataFrame({
    "ID": [1, 2, 3, 4, 5],
    "Age": [25, 30, 35, 28, 40],
    "Designation Level": [1, 2, 3, 2, 3]
})
final.loc[final["Age"]>29,"Designation Level"] = -1
final["Designation Level"] = final["Designation Level"].clip(upper=4)
final[["ID","Age","Designation Level"]].drop_duplicates()

   ID  Age  Designation Level
0   1   25                  1
1   2   30                 -1
2   3   35                 -1
3   4   28                  2
4   5   40                 -1

In [20]:
# Task 7: Add Mr./Mrs. prefix to First Name and drop Gender

# Define prefix mapping
prefix_map = {"M": "Mr.", "F": "Mrs."}

# Make sure we have First Name column (from Task 3)
if "First Name" not in final.columns and "Name" in final.columns:
    # Split Name into First Name and LastName if not already done
    final[["First Name","LastName"]] = final["Name"].str.split(" ", n=1, expand=True)
    final.drop(columns=["Name"], inplace=True)

# Add prefix safely
if "Gender" in final.columns:
    final["First Name"] = final["Gender"].map(prefix_map).fillna("") + " " + final["First Name"]
    # Drop Gender column
    final.drop(columns=["Gender"], inplace=True)
else:
    # If Gender column is missing, just keep First Name as is
    final["First Name"] = final["First Name"]

# Show cleaned employee details
print(final[["ID","First Name","LastName","City","Age"]].drop_duplicates())

     ID  First Name   LastName     City  Age
0  A001    Mr. John      Alter    Paris   25
1  A002  Mrs. Alice  Luxumberg   London   27
2  A003     Mr. Tom  Sabestine   Berlin   29
3  A004   Mrs. Nina      Adgra  Newyork   31
4  A005    Mrs. Amy      Johny   Madrid   30

In [5]:
# Task 8: Promote designation for Age >29
import pandas as pd
final = pd.DataFrame({
    "ID": [1, 2, 3, 4, 5],
    "Age": [25, 30, 35, 28, 40],
    "Designation Level": [1, 2, 3, 2, 3]
})
final.loc[final["Age"]>29,"Designation Level"] = +1
final["Designation Level"] = final["Designation Level"].clip(upper=4)
final[["ID","Age","Designation Level"]].drop_duplicates()

   ID  Age  Designation Level
0   1   25                  1
1   2   30                  1
2   3   35                  1
3   4   28                  2
4   5   40                  1

In [22]:
# Task 9: TotalProjCost DataFrame
if "First Name" in final.columns:
    total_proj_cost = final.groupby(["ID","First Name"], as_index=False)["Cost"].sum()
else:
    # fallback if only "Name" exists
    total_proj_cost = final.groupby(["ID","Name"], as_index=False)["Cost"].sum()

total_proj_cost.rename(columns={"Cost":"Total cost"}, inplace=True)
total_proj_cost.to_csv("TotalProjCost.csv", index=False)
print(total_proj_cost)

     ID  First Name  Total cost
0  A001    Mr. John   3002000.0
1  A002  Mrs. Alice   2680000.0
2  A003     Mr. Tom   5150000.0
3  A004   Mrs. Nina   9500000.0
4  A005    Mrs. Amy    600000.0

In [24]:
# Task 10: Employees whose City contains 'o'
mask = final["City"].str.contains("o", case=False, na=False)

# Choose whichever name columns exist
cols_to_show = ["ID","First Name","LastName","City","Age"]
available_cols = [c for c in cols_to_show if c in final.columns]

print(final.loc[mask, available_cols].drop_duplicates())

     ID  First Name   LastName     City  Age
1  A002  Mrs. Alice  Luxumberg   London   27
3  A004   Mrs. Nina      Adgra  Newyork   31